Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ32GB002.h
#define _DSGPR0_DSGPR0_POSITION                  0x00000000
#define _DSGPR0_DSGPR0_MASK                      0x00000001
#define _DSGPR0_DSGPR0_LENGTH                    0x00000001

#define _DSGPR0_DSGPR1_POSITION                  0x00000001
#define _DSGPR0_DSGPR1_MASK                      0x00000002
#define _DSGPR0_DSGPR1_LENGTH                    0x00000001

#define _DSGPR0_DSGPR2_POSITION                  0x00000002
#define _DSGPR0_DSGPR2_MASK                      0x00000004
#define _DSGPR0_DSGPR2_LENGTH                    0x00000001

#define _DSGPR0_DSGPR3_POSITION                  0x00000003
#define _DSGPR0_DSGPR3_MASK                      0x00000008
#define _DSGPR0_DSGPR3_LENGTH                    0x00000001

#define _DSGPR0_DSGPR4_POSITION                  0x00000004
#define _DSGPR0_DSGPR4_MASK                      0x00000010
#define _DSGPR0_DSGPR4_LENGTH                    0x00000001

#define _DSGPR0_DSGPR5_POSITION                  0x00000005
#define _DSGPR0_DSGPR5_MASK                      0x00000020
#define _DSGPR0_DSGPR5_LENGTH                    0x00000001

#define _DSGPR0_DSGPR6_POSITION                  0x00000006
#define _DSGPR0_DSGPR6_MASK                      0x00000040
#define _DSGPR0_DSGPR6_LENGTH                    0x00000001

#define _DSGPR0_DSGPR7_POSITION                  0x00000007
#define _DSGPR0_DSGPR7_MASK                      0x00000080
#define _DSGPR0_DSGPR7_LENGTH                    0x00000001

#define _DSGPR0_DSGPR8_POSITION                  0x00000008
#define _DSGPR0_DSGPR8_MASK                      0x00000100
#define _DSGPR0_DSGPR8_LENGTH                    0x00000001

#define _DSGPR0_DSGPR9_POSITION                  0x00000009
#define _DSGPR0_DSGPR9_MASK                      0x00000200
#define _DSGPR0_DSGPR9_LENGTH                    0x00000001

#define _DSGPR0_DSGPR10_POSITION                 0x0000000A
#define _DSGPR0_DSGPR10_MASK                     0x00000400
#define _DSGPR0_DSGPR10_LENGTH                   0x00000001

#define _DSGPR0_DSGPR11_POSITION                 0x0000000B
#define _DSGPR0_DSGPR11_MASK                     0x00000800
#define _DSGPR0_DSGPR11_LENGTH                   0x00000001

#define _DSGPR0_DSGPR12_POSITION                 0x0000000C
#define _DSGPR0_DSGPR12_MASK                     0x00001000
#define _DSGPR0_DSGPR12_LENGTH                   0x00000001

#define _DSGPR0_DSGPR13_POSITION                 0x0000000D
#define _DSGPR0_DSGPR13_MASK                     0x00002000
#define _DSGPR0_DSGPR13_LENGTH                   0x00000001

#define _DSGPR0_DSGPR14_POSITION                 0x0000000E
#define _DSGPR0_DSGPR14_MASK                     0x00004000
#define _DSGPR0_DSGPR14_LENGTH                   0x00000001

#define _DSGPR0_DSGPR15_POSITION                 0x0000000F
#define _DSGPR0_DSGPR15_MASK                     0x00008000
#define _DSGPR0_DSGPR15_LENGTH                   0x00000001

#define _DSGPR1_DSGPR_POSITION                   0x00000000
#define _DSGPR1_DSGPR_MASK                       0x0000FFFF
#define _DSGPR1_DSGPR_LENGTH                     0x00000010

#define _DSGPR1_DSGPR0_POSITION                  0x00000000
#define _DSGPR1_DSGPR0_MASK                      0x00000001
#define _DSGPR1_DSGPR0_LENGTH                    0x00000001

#define _DSGPR1_DSGPR1_POSITION                  0x00000001
#define _DSGPR1_DSGPR1_MASK                      0x00000002
#define _DSGPR1_DSGPR1_LENGTH                    0x00000001

#define _DSGPR1_DSGPR2_POSITION                  0x00000002
#define _DSGPR1_DSGPR2_MASK                      0x00000004
#define _DSGPR1_DSGPR2_LENGTH                    0x00000001

#define _DSGPR1_DSGPR3_POSITION                  0x00000003
#define _DSGPR1_DSGPR3_MASK                      0x00000008
#define _DSGPR1_DSGPR3_LENGTH                    0x00000001

#define _DSGPR1_DSGPR4_POSITION                  0x00000004
#define _DSGPR1_DSGPR4_MASK                      0x00000010
#define _DSGPR1_DSGPR4_LENGTH                    0x00000001

#define _DSGPR1_DSGPR5_POSITION                  0x00000005
#define _DSGPR1_DSGPR5_MASK                      0x00000020
#define _DSGPR1_DSGPR5_LENGTH                    0x00000001

#define _DSGPR1_DSGPR6_POSITION                  0x00000006
#define _DSGPR1_DSGPR6_MASK                      0x00000040
#define _DSGPR1_DSGPR6_LENGTH                    0x00000001

#define _DSGPR1_DSGPR7_POSITION                  0x00000007
#define _DSGPR1_DSGPR7_MASK                      0x00000080
#define _DSGPR1_DSGPR7_LENGTH                    0x00000001

#define _DSGPR1_DSGPR8_POSITION                  0x00000008
#define _DSGPR1_DSGPR8_MASK                      0x00000100
#define _DSGPR1_DSGPR8_LENGTH                    0x00000001

#define _DSGPR1_DSGPR9_POSITION                  0x00000009
#define _DSGPR1_DSGPR9_MASK                      0x00000200
#define _DSGPR1_DSGPR9_LENGTH                    0x00000001

#define _DSGPR1_DSGPR10_POSITION                 0x0000000A
#define _DSGPR1_DSGPR10_MASK                     0x00000400
#define _DSGPR1_DSGPR10_LENGTH                   0x00000001

#define _DSGPR1_DSGPR11_POSITION                 0x0000000B
#define _DSGPR1_DSGPR11_MASK                     0x00000800
#define _DSGPR1_DSGPR11_LENGTH                   0x00000001

#define _DSGPR1_DSGPR12_POSITION                 0x0000000C
#define _DSGPR1_DSGPR12_MASK                     0x00001000
#define _DSGPR1_DSGPR12_LENGTH                   0x00000001

#define _DSGPR1_DSGPR13_POSITION                 0x0000000D
#define _DSGPR1_DSGPR13_MASK                     0x00002000
#define _DSGPR1_DSGPR13_LENGTH                   0x00000001

#define _DSGPR1_DSGPR14_POSITION                 0x0000000E
#define _DSGPR1_DSGPR14_MASK                     0x00004000
#define _DSGPR1_DSGPR14_LENGTH                   0x00000001

#define _DSGPR1_DSGPR15_POSITION                 0x0000000F
#define _DSGPR1_DSGPR15_MASK                     0x00008000
#define _DSGPR1_DSGPR15_LENGTH                   0x00000001

#define _NVMCON_NVMOP_POSITION                   0x00000000
#define _NVMCON_NVMOP_MASK                       0x0000000F
#define _NVMCON_NVMOP_LENGTH                     0x00000004

#define _NVMCON_ERASE_POSITION                   0x00000006
#define _NVMCON_ERASE_MASK                       0x00000040
#define _NVMCON_ERASE_LENGTH                     0x00000001

#define _NVMCON_WRERR_POSITION                   0x0000000D
#define _NVMCON_WRERR_MASK                       0x00002000
#define _NVMCON_WRERR_LENGTH                     0x00000001

#define _NVMCON_WREN_POSITION                    0x0000000E
#define _NVMCON_WREN_MASK                        0x00004000
#define _NVMCON_WREN_LENGTH                      0x00000001

#define _NVMCON_WR_POSITION                      0x0000000F
#define _NVMCON_WR_MASK                          0x00008000
#define _NVMCON_WR_LENGTH                        0x00000001

#define _NVMCON_NVMOP0_POSITION                  0x00000000
#define _NVMCON_NVMOP0_MASK                      0x00000001
#define _NVMCON_NVMOP0_LENGTH                    0x00000001

#define _NVMCON_NVMOP1_POSITION                  0x00000001
#define _NVMCON_NVMOP1_MASK                      0x00000002
#define _NVMCON_NVMOP1_LENGTH                    0x00000001

#define _NVMCON_NVMOP2_POSITION                  0x00000002
#define _NVMCON_NVMOP2_MASK                      0x00000004
#define _NVMCON_NVMOP2_LENGTH                    0x00000001

#define _NVMCON_NVMOP3_POSITION                  0x00000003
#define _NVMCON_NVMOP3_MASK                      0x00000008
#define _NVMCON_NVMOP3_LENGTH                    0x00000001

#define _NVMCON_PROGOP0_POSITION                 0x00000000
#define _NVMCON_PROGOP0_MASK                     0x00000001
#define _NVMCON_PROGOP0_LENGTH                   0x00000001

